Terraform Plan:

```
module.data_ingester.random_string.resource_code: Refreshing state... [id=p3sha]
module.data_ingester.data.azurerm_client_config.current: Reading...
module.data_ingester.azurerm_resource_group.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics]
module.data_ingester.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iN2VjMGExZC1hZjAyLTQ2YzUtOTdkMS05MDBkNGUzMmNmOTM7b2JqZWN0SWQ9YjdlY2YxYWUtYzE0Zi00YmU4LWE4ZDEtZGI3YjUxNTdkNWQ5O3N1YnNjcmlwdGlvbklkPTMyNTkxZjIyLTgyMDktNGM4Mi1hNjVjLTYxOGI5NjdlN2JmZjt0ZW5hbnRJZD05YzdkOWRkMy04NDBjLTRiM2YtODE4ZS01NTI4NjUwODJlMTY=]
module.data_ingester.azurerm_service_plan.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha]
module.data_ingester.azurerm_storage_account.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Storage/storageAccounts/tfstatep3sha]
module.data_ingester.azurerm_storage_container.tfstate: Refreshing state... [id=https://tfstatep3sha.blob.core.windows.net/tfstate]
module.data_ingester.azurerm_linux_function_app.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha]
module.data_ingester.azurerm_key_vault.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics]
module.data_ingester.azurerm_key_vault_certificate.example: Refreshing state... [id=https://ssphp-metrics.vault.azure.net/certificates/ad-client-certificate/f824d238855648b581f1a3840c3e7286]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.data_ingester.data.archive_file.data_ingester_rust will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "data_ingester_rust" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../data_ingester/../../data_ingester_workspace/data_ingester_axum_entrypoint/function_zip/"
      + type                = "zip"
    }

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust will be updated in-place
  ~ resource "azurerm_linux_function_app" "SSPHP_rust" {
      ~ app_settings                                   = {
          + "FUNCTIONS_EXTENSION_VERSION" = "~4"
            # (6 unchanged elements hidden)
        }
        id                                             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha"
        name                                           = "SSPHP-Metrics-rust-p3sha"
        tags                                           = {
            "Environment"      = "Dev"
            "Product"          = "Protective Monitoring - Splunk SaaS"
            "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
      ~ zip_deploy_file                                = "../data_ingester/data_ingester_rust_20250102031616.zip" -> (known after apply)
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.data_ingester.azurerm_storage_container.tfstate,
  on ../data_ingester/module.tf line 36, in resource "azurerm_storage_container" "tfstate":
  36:   storage_account_name  = azurerm_storage_account.tfstate.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
stdout<<ghadelimiter_5be37adb-de59-49d1-a1a2-c5a937ecab2a
module.data_ingester.random_string.resource_code: Refreshing state... [id=p3sha]
module.data_ingester.data.azurerm_client_config.current: Reading...
module.data_ingester.azurerm_resource_group.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics]
module.data_ingester.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iN2VjMGExZC1hZjAyLTQ2YzUtOTdkMS05MDBkNGUzMmNmOTM7b2JqZWN0SWQ9YjdlY2YxYWUtYzE0Zi00YmU4LWE4ZDEtZGI3YjUxNTdkNWQ5O3N1YnNjcmlwdGlvbklkPTMyNTkxZjIyLTgyMDktNGM4Mi1hNjVjLTYxOGI5NjdlN2JmZjt0ZW5hbnRJZD05YzdkOWRkMy04NDBjLTRiM2YtODE4ZS01NTI4NjUwODJlMTY=]
module.data_ingester.azurerm_service_plan.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha]
module.data_ingester.azurerm_storage_account.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Storage/storageAccounts/tfstatep3sha]
module.data_ingester.azurerm_storage_container.tfstate: Refreshing state... [id=https://tfstatep3sha.blob.core.windows.net/tfstate]
module.data_ingester.azurerm_linux_function_app.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha]
module.data_ingester.azurerm_key_vault.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics]
module.data_ingester.azurerm_key_vault_certificate.example: Refreshing state... [id=https://ssphp-metrics.vault.azure.net/certificates/ad-client-certificate/f824d238855648b581f1a3840c3e7286]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.data_ingester.data.archive_file.data_ingester_rust will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "data_ingester_rust" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../data_ingester/../../data_ingester_workspace/data_ingester_axum_entrypoint/function_zip/"
      + type                = "zip"
    }

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust will be updated in-place
  ~ resource "azurerm_linux_function_app" "SSPHP_rust" {
      ~ app_settings                                   = {
          + "FUNCTIONS_EXTENSION_VERSION" = "~4"
            # (6 unchanged elements hidden)
        }
        id                                             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha"
        name                                           = "SSPHP-Metrics-rust-p3sha"
        tags                                           = {
            "Environment"      = "Dev"
            "Product"          = "Protective Monitoring - Splunk SaaS"
            "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
      ~ zip_deploy_file                                = "../data_ingester/data_ingester_rust_20250102031616.zip" -> (known after apply)
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.data_ingester.azurerm_storage_container.tfstate,
  on ../data_ingester/module.tf line 36, in resource "azurerm_storage_container" "tfstate":
  36:   storage_account_name  = azurerm_storage_account.tfstate.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

ghadelimiter_5be37adb-de59-49d1-a1a2-c5a937ecab2a
stderr<<ghadelimiter_3274230b-d470-4430-be9d-710fffebe7a9

ghadelimiter_3274230b-d470-4430-be9d-710fffebe7a9
exitcode<<ghadelimiter_b40b3896-d8e3-42cb-8385-1bf779810e8a
0
ghadelimiter_b40b3896-d8e3-42cb-8385-1bf779810e8a
```